demo/models/Supplier.php

SELECT `t_status` FROM `supplier` GROUP BY `t_status`
---
    public static function statusSelectOptions(){
	    $items = [];
	    foreach((array)Supplier::find()->select(['t_status'])->groupBy(['t_status'])->column() as $v) $items[$v] = $v;