demo/controllers/SupplierController.php

INSERT INTO `supplier` (`name`, `code`, `t_status`) VALUES ('', '', 'ok')
---
    public function actionCreate()
    {
        $model = new Supplier();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {