demo/controllers/SupplierController.php

    public function actionCsv()
    {

        if ($this->request->isPost) {
            $fields = array_keys($this->request->post("fields"));
            $where = [];
            $values = [];

            $ids = explode(",",$this->request->get("ids"));
            foreach((array)$ids as $k=>$v) {
                $ids[$k] = intval($v);

            }
            $where[] = "id in (".implode(",", $ids).")";

            $data = Supplier::find()->select($fields)->where($where,$values)->asArray()->all();
---
SELECT * FROM `supplier` WHERE `id`='5'